### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [12]:
import pandas as pd

In [28]:
data1=[4, 8, 15, 16, 23,42]
s=pd.Series(data1)
#series 
print(type(s))
s

<class 'pandas.core.series.Series'>

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
or-------------------------------------------------------------------------------------------------------------------

In [18]:
data={'series':[4, 8, 15, 16, 23,42]}

In [19]:
df=pd.DataFrame(data)

In [23]:
# series 
print(type(df['series']))
df['series']

<class 'pandas.core.series.Series'>

0     4
1     8
2    15
3    16
4    23
5    42
Name: series, dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the  variable print it.

In [31]:
var=[1,2,3,4,5,6,7,8,9,10]
pd.Series(var)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data: 

Name 
Alice 
Bob 
Claire 
Then, print the DataFrame. 
Age 25 
30 
27 
Gender Female Male 
Female

In [33]:
pdf={'Name':['Alice','Bob','Claire'],
     'Age':[25,30,27],
     'Gender':['Female','Male','Female']
 }
df=pd.DataFrame(pdf)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example. 
DataFrame:

A DataFrame is a two-dimensional, tabular data structure similar to a spreadsheet or a SQL table.
It consists of rows and columns, where each column can contain different data types.
DataFrames are capable of handling structured data with labeled axes (rows and columns).
It can be thought of as a collection of Series objects where each Series represents a column.
Series:

A Series is a one-dimensional array-like object that can store data of any data type.
It is essentially a single column of data with an associated index.
Series objects are similar to Python lists or NumPy arrays but have additional features like labeled indexing.
They are the building blocks of a DataFrame.

In [52]:
import pandas as pd

# Creating a Series
series_data = pd.Series([1, 2, 3, 4, 5], name='MySeries')

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)

# Displaying the Series and DataFrame
print("Series:")
print(series_data)

print("\nDataFrame:")
df

Series:
0    1
1    2
2    3
3    4
4    5
Name: MySeries, dtype: int64

DataFrame:

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can  you give an example of when you might use one of these functions?

In [41]:
#1) head() and tail(): These functions allow you to view the first or last few rows of a DataFrame
df.head()  # View the first 5 rows of the DataFrame
df.tail(10)  # View the last 10 rows of the DataFrame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [42]:
df.shape  #This attribute returns a tuple representing the dimensions

(3, 3)

In [43]:
df.info()#This method provides a concise summary of the DataFrame's structure, including data types and missing values.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [46]:
#This method computes various summary statistics for numerical columns in the DataFrame, such as count, mean, std, min, max, etc.
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [49]:
# You can use this method to sort the DataFrame by one or more columns in ascending or descending order.
df.sort_values(by='Name', ascending=False)

     Name  Age  Gender
2  Claire   27  Female
1     Bob   30    Male
0   Alice   25  Female

In [53]:
df.drop(columns=['Age'], inplace=True)#drop rows and columns
df.fillna(0)  # Fill missing values with 0

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel? 
In Pandas, Series and DataFrame are mutable, while Panel is deprecated as of Pandas version 0.25.0 and is no longer part of the official Pandas library. Therefore, it's important to focus on understanding the mutability of Series and DataFrame:

Series: A Pandas Series is mutable, meaning you can change its values after it has been created. You can modify individual elements, add or remove elements, or update the entire Series as needed.

DataFrame: A Pandas DataFrame is also mutable. You can modify its contents, including adding or removing columns, changing values within cells, and performing various data manipulations.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [59]:
import pandas as pd

s1 = pd.Series(['Alice', 'Bob', 'Claire'], name='Name')
s2 = pd.Series([25, 30, 27], name='Age')
s3 = pd.Series(['Female', 'Male', 'Female'], name='Gender')

# Concatenate the Series horizontally (side by side)
df = pd.concat([s1, s2, s3], axis=1)
# Create a dictionary and convert it into a DataFrame
data = {'Name': s1, 'Age': s2, 'Gender': s3}
df2 = pd.DataFrame(data)

# Display the resulting DataFrame
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female